{
  "Domain": "DWBI",
  "topics": [
    "IDGC",
    "Principles",
    "Stewardship",
    "Audit",
    "Identify high-level analytics outcomes and decision needs across domains.",
    "Metadata",
    "Document the vision using DAMA artefact structure “Chapter 3 Appendix, p. 69–70”.",
    "Use DCAM value mapping to express BI vision in measurable capability terms.",
    "Identify primary analytical subjects such as sales, finance, operations, and customer data.",
    "Map business questions to master and reference domains “Chapter 6, p. 182–188”.",
    "Include quality thresholds needed for analytical reliability “Chapter 11, p. 308–311”.",
    "Capture business scope using DAMA documentation practices “Chapter 3 Appendix, p. 69–70”.",
    "Use CMMI scoping practices to ensure feasible delivery increments.",
    "Use DCAM architecture capability mapping to identify architectural gaps.",
    "Approve quality and lineage controls aligned with DAMA best practices “Chapter 11, p. 308–311”.",
    "Validate business rules and metric definitions.",
    "Define responsibility allocation between owners, stewards, and custodians “Chapter 4, p. 86–89”.",
    "Document approval outcomes using DAMA governance artefacts “Chapter 3 Appendix, p. 69–70”.",
    "Use DCAM control effectiveness criteria to classify control strength.",
    "Validate adherence to publication and certification processes.",
    "Track recurrent failures to update standards or processes.",
    "Store logs using DAMA artefact structure “Chapter 3 Appendix, p. 69–70”.",
    "Use DCAM operating model diagnostics to identify weak governance areas.",
    "Implement automated checks for conformance to master data, reference lists, and dimensional structures “Chapter 6, p. 182–188”.",
    "Validate metric definitions against governed logic.",
    "Include lineage validation checkpoints.",
    "Document rules using DAMA artefact practices “Chapter 3 Appendix, p. 69–70”.",
    "Use the CMMI automation readiness assessment before deployment.",
    "Clarify source-of-truth and lineage documentation expectations “Chapter 9, p. 236–239”.",
    "Ensure consistency across dimensions and conformed attributes.",
    "Validate updates through governance forums “Chapter 3.4, p. 60–61”.",
    "Use CMMI continuous improvement to manage standard updates."
  ]
}