{
  "Domain": "RMD",
  "topics": [
    "IDGC",
    "Principles",
    "Stewardship",
    "Audit",
    "Clarify the distinction between master and reference data defined by DAMA “Chapter 6, p. 186–188”.",
    "Validate lifecycle coverage, including creation, approval, distribution, and retirement “Chapter 4.3, p. 92”.",
    "DCAM capability scoping",
    "Identify candidate master domains such as customer, supplier, product, and organization “Chapter 6, p. 182–186”.",
    "Identify reference lists such as classifications, controlled vocabularies, and status values “Chapter 6, p. 186–188”.",
    "Metadata",
    "Validate catalogue entries across business domains.",
    "Apply CMMI scoping to structure delivery waves.",
    "Identify lifecycle control points for creation, validation, enrichment, and publication “Chapter 6, p. 184–188”.",
    "Attach quality checks following DAMA quality dimensions “Chapter 11, p. 308–311”.",
    "Use DCAM criticality mapping to prioritize high-impact points.",
    "Assign owners, stewards, and custodians according to DAMA governance roles “Chapter 4, p. 86–89”.",
    "Clarify decision rights based on DAMA escalation guidance “Chapter 3.4, p. 60–61”.",
    "Ensure lifecycle responsibilities include onboarding, updates, conflict resolution, and retirement “Chapter 4.3, p. 92”.",
    "Record assignments following DAMA artefact documentation “Chapter 3 Appendix, p. 69–70”.",
    "Explain the purpose and enterprise relevance of master and reference data “Chapter 6, p. 180–188”.",
    "Clarify responsibilities of owners, stewards, and custodians “Chapter 3.2, p. 55–57”.",
    "Lifecycle checkpoints",
    "Publish guidelines using DAMA artefact structure “Chapter 3 Appendix, p. 69–70”.",
    "Use CMMI communication practices to support adoption across the business and technology domains.",
    "Consolidate requirements for accuracy, completeness, consistency, and uniqueness using DAMA quality dimensions “Chapter 11, p. 308–311”.",
    "Capture business rules for sourcing, validation, and conflict resolution of master entities “Chapter 6, p. 184–186”.",
    "Identify reference list requirements, including structure, stability, and approval conditions “Chapter 6, p. 186–188”.",
    "Assign requirement ownership following governance roles “Chapter 3.2, p. 55–57”.",
    "Use DCAM prioritization to rank requirements by enterprise impact.",
    "Structure lifecycle processes such as identification, modelling, sourcing, maintenance, and retirement following DAMA “Chapter 6, p. 180–188”.",
    "Include governance roles, artefacts, decision rights, and escalation rules “Chapter 3.4, p. 60–61”.",
    "Data Quality",
    "Document the framework using DAMA artefact formatting “Chapter 3 Appendix, p. 69–70”.",
    "Use CMMI framework verification practices to ensure complete coverage of lifecycle activities.",
    "Define naming conventions, identifiers, keys, survivorship logic, and versioning rules consistent with DAMA “Chapter 6, p. 184–186”.",
    "Define reference list structures, approval steps, and versioning requirements “Chapter 6, p. 186–188”.",
    "Include quality thresholds and validation conditions aligned with DAMA quality dimensions “Chapter 11, p. 308–311”.",
    "GDPR",
    "Confirm semantic alignment with business terminology following DAMA modelling guidance “Chapter 10, p. 282–284”.",
    "Validate survivorship and sourcing rules against operational feasibility.",
    "Ensure reference list structures reflect real business classification needs.",
    "Capture feedback and version changes using DAMA artefact structure “Chapter 3 Appendix, p. 69–70”.",
    "Use DCAM alignment practices to balance global consistency and local flexibility.",
    "Submit standards through formal decision bodies “Chapter 3.4, p. 60–61”.",
    "Validate coverage for priority domains such as customer, product, or location “Chapter 6, p. 182–186”.",
    "Communicate standards using DAMA governance communication practices “Chapter 3.6, p. 64–66”.",
    "Use CMMI readiness assessments before enforcing adoption.",
    "Align charter structure with enterprise governance layers “Figure 3.2, p. 53”.",
    "Include responsibilities for approval of standards, escalations, and prioritization.",
    "Document charter using DAMA artefact structure “Chapter 3 Appendix, p. 69–70”.",
    "DCAM Governance",
    "Compliance",
    "Assign accountable owners, stewards, and custodians following DAMA definitions “Chapter 4, p. 86–89”.",
    "Clarify who may request changes and who approves them “Chapter 3.4, p. 60–61”.",
    "Ensure each master domain has a dedicated accountable owner.",
    "Record assignments using DAMA artefact documentation “Chapter 3 Appendix, p. 69–70”.",
    "Include agenda items such as new domains, standard updates, and exception approvals.",
    "Apply structured decision templates aligned with DAMA governance practices “Chapter 3.6, p. 64–66”.",
    "Evaluate impacts across architecture, quality, security, and lifecycle.",
    "Store decisions using DAMA artefact patterns “Chapter 3 Appendix, p. 69–70”.",
    "Review unresolved duplicates, conflicting classifications, and inconsistent identifiers “Chapter 11, p. 308–311”.",
    "Decide on remediation paths through formal governance “Chapter 3.4, p. 60–61”.",
    "Record review outcomes using DAMA artefact templates “Chapter 3 Appendix, p. 69–70”.",
    "Use DCAM assurance practices to link reviews to enterprise outcomes.",
    "Maintain records of decisions, waivers, escalations, and open actions “Chapter 3.6, p. 64–66”.",
    "Link log entries to affected domains and quality indicators.",
    "Review patterns of recurring issues to refine standards.",
    "Store logs following DAMA artefact structure “Chapter 3 Appendix, p. 69–70”.",
    "Use CMMI monitoring techniques to detect governance capacity issues.",
    "Position checkpoints where master or reference data are created or changed “Chapter 6, p. 184–188”.",
    "Ensure workflow steps enforce naming, coding, and validation rules.",
    "Escalate exceptions through formal governance channels “Chapter 3.4, p. 60–61”.",
    "Document workflows using DAMA artefact conventions “Chapter 3 Appendix, p. 69–70”.",
    "Use DCAM workflow governance mapping to ensure consistent enforcement.",
    "Require systems to source master data exclusively from approved repositories “Chapter 6, p. 184–186”.",
    "Reject or flag values that are inconsistent with reference lists.",
    "Align with integration governance for ingestion and distribution “Chapter 8, p. 252–260”.",
    "Document rules and templates using DAMA artefact guidance “Chapter 3 Appendix, p. 69–70”.",
    "Represent lifecycle stages where master or reference values are used or changed to “Chapter 4.3, p. 92”.",
    "Link lifecycle changes to updates in master and reference lists.",
    "Align retention rules with business process lifecycle.",
    "Publish documentation using DAMA artefact structure “Chapter 3 Appendix, p. 69–70”.",
    "Use DCAM lifecycle mapping to visualize dependencies.",
    "Validate requests for new systems, flows, or models against master and reference standards.",
    "Identify cases of duplicate local lists or nonstandard identifiers.",
    "Ensure decisions follow DAMA escalation logic “Chapter 3.4, p. 60–61”.",
    "Record outcomes using DAMA documentation practices “Chapter 3 Appendix, p. 69–70”.",
    "Track adherence to naming, coding, sourcing, and reference list usage.",
    "Log exceptions and waivers with justification.",
    "Validate remediation plans through governance bodies.",
    "Use DCAM diagnostic indicators to prioritize remediation.",
    "Define KPIs such as duplicate rate, missing mandatory values, and adoption coverage “Chapter 11, p. 308–311”.",
    "Include distribution performance and timeliness.",
    "Assign KPI responsibility following DAMA governance roles “Chapter 4, p. 86–89”.",
    "Use DCAM capability indicators to construct a maturity dashboard.",
    "Implement rules for uniqueness, valid codes, referential integrity, and survivorship “Chapter 11, p. 308–311”.",
    "Route exceptions to stewards for review.",
    "Document rules following DAMA artefact structure “Chapter 3 Appendix, p. 69–70”.",
    "Use CMMI automation readiness checks before rollout.",
    "Use hub, publish–subscribe or controlled API distribution models “Chapter 8, p. 252–260”.",
    "Implement feedback channels for consumers to report inconsistencies.",
    "Document distribution architecture using DAMA artefact formats “Chapter 3 Appendix, p. 69–70”.",
    "Use DCAM architectural capability guidance to select optimal distribution mechanisms.",
    "Create alerts for duplicates, invalid values, synchronization failures, and misuse of reference lists.",
    "Route alerts to owners and stewards based on domain responsibility “Chapter 4, p. 86–89”.",
    "Record alert outcomes using DAMA documentation guidelines “Chapter 3 Appendix, p. 69–70”.",
    "Use CMMI incident-handling logic to define structured response paths.",
    "Capture changes in rule logic, thresholds, and distribution mechanisms.",
    "Validate ongoing alignment with standards and definitions “Chapter 6, p. 184–188”.",
    "Extend automation to new domains progressively.",
    "Store logs using DAMA artefact formats “Chapter 3 Appendix, p. 69–70”.",
    "Use DCAM capability evolution analysis to plan future automation improvements.",
    "Compare performance across domains to detect structural issues.",
    "Review distribution and synchronization delays “Chapter 6, p. 184–188”.",
    "Document analysis using DAMA artefact structure “Chapter 3 Appendix, p. 69–70”.",
    "Use DCAM capability scoring to benchmark maturity.",
    "Adjust definitions, survivorship rules, naming conventions, and code structures “Chapter 6, p. 186–188”.",
    "Amend domain boundaries where overlap or ambiguity exists.",
    "Validate updates through governance forums “Chapter 3.4, p. 60–61”.",
    "Use CMMI continuous improvement logic to release updates in controlled increments.",
    "Compare practices with industry or regulatory models for shared data management.",
    "Map external benchmarks to DAMA expectations for master and reference governance “Chapter 6, p. 180–188”.",
    "Identify governance, quality, and architecture gaps.",
    "Document findings using DAMA artefact patterns “Chapter 3 Appendix, p. 69–70”.",
    "Use DCAM benchmarking techniques to translate comparisons into capability targets.",
    "Extend validation and distribution logic to cover new failure modes and inconsistencies.",
    "Validate logic in controlled environments before deployment.",
    "Seek approval for major updates through governance forums “Chapter 3.4, p. 60–61”.",
    "Use CMMI automation maturity indicators to guide investment.",
    "Maintain a backlog of improvements tied to KPI trends, issue logs, and business needs “Chapter 3.6, p. 64–66”.",
    "Group improvements into short, medium, and long-term initiatives.",
    "Align improvements with enterprise data governance roadmap “Chapter 3, p. 51–53”.",
    "Track progress using DAMA artefact documentation “Chapter 3 Appendix, p. 69–70”.",
    "Use DCAM capability evolution mapping to steer long-term maturity gains."
  ]
}