{
  "Domain": "AIML",
  "topics": [
    "Audit",
    "Metadata",
    "Data Quality",
    "Principles",
    "Compliance",
    "Distinguish experimental analytics from production models and regulated AI use cases.",
    "DCAM capability scoping",
    "Define lifecycle stages covering development, training, validation, deployment, monitoring, and retirement aligned with DAMA analytics lifecycle concepts (Chapter 16).",
    "Define governance checkpoints per stage, including approval, documentation, validation, and retirement triggers.",
    "Ensure checkpoints explicitly include data readiness, feature readiness, and monitoring readiness.",
    "Use CMMI institutionalization logic to ensure checkpoints become repeatable governance routines.",
    "Define documentation covering model purpose, assumptions, datasets, features, evaluation results, and operational constraints (Chapter 16).",
    "Classify models by business impact, operational risk, and regulatory exposure following DAMA analytics risk concepts (Chapter 16).",
    "Ensure linkage between critical models and critical data elements where applicable.",
    "Use DCAM critical data and analytics classification practices to prioritize governance controls.",
    "Communicate governance expectations following DAMA governance communication guidance (Chapter 3.6).",
    "Ensure stakeholders understand lifecycle responsibilities and accountability boundaries.",
    "IDGC",
    "Adapt DAMA owner, steward, and custodian roles to analytics and model accountability (Chapters 3 and 16).",
    "Stewardship",
    "Use DCAM operating model guidance to validate role feasibility.",
    "Assign ownership across model lifecycle stages (Chapter 16).",
    "Decision authority",
    "Use IBM DGCM accountability mechanisms to resolve cross-functional ownership conflicts.",
    "Define approval authority for deployment, retraining, rollback, and retirement decisions.",
    "Align authority with DAMA governance decision-rights models (Chapter 3).",
    "Use DCAM decision governance practices to formalize approval workflows.",
    "Communicate roles following DAMA governance adoption and communication guidance (Chapter 3.6).",
    "Use CMMI institutionalization indicators to reinforce role adoption.",
    "Define criteria covering accuracy, robustness, drift, bias, explainability, and risk using DAMA analytics quality concepts (Chapter 16).",
    "Use NIST AI RMF as complementary guidance for risk structuring.",
    "Define thresholds for deployment, retraining, and rollback decisions.",
    "Align KPIs with DAMA governance measurement practices (Chapter 3.6).",
    "DCAM Measurement",
    "Define approval rules for promotion, retraining, and decommissioning of models.",
    "Validate using DAMA governance oversight structures (Chapter 3.4).",
    "Use IBM DGCM governance councils for formal endorsement.",
    "GDPR",
    "Embed checkpoints across training and validation stages aligned with DAMA lifecycle governance (Chapter 16).",
    "Use CMMI process integration guidance to stabilize workflows.",
    "Lifecycle checkpoints",
    "Use DCAM automation readiness checks where pipelines are automated.",
    "Align routines with DAMA analytics monitoring practices (Chapter 16).",
    "Use NIST AI RMF Measure function as reference.",
    "Ensure traceability across lifecycle stages and controls.",
    "Use DAMA artefact management guidance for documentation consistency.",
    "Use DCAM control execution indicators to verify effectiveness.",
    "Monitor using DAMA analytics performance guidance (Chapter 16).",
    "Use NIST AI RMF Measure function as complementary input.",
    "Align reviews with DAMA governance oversight activities (Chapter 3.3).",
    "Apply DAMA escalation and corrective action guidance (Chapter 3.4).",
    "Use CMMI corrective action practices.",
    "Report metrics following DAMA governance measurement practices (Chapter 3.6).",
    "Use DCAM benchmarking indicators where available.",
    "Use DCAM maturity levels for comparative benchmarking.",
    "Prioritize gaps by risk, impact, and analytical criticality (Chapter 16).",
    "Use IBM DGCM improvement mechanisms for structured remediation.",
    "Align roadmap with DAMA continuous improvement guidance (Chapter 3.6).",
    "Use CMMI staged improvement logic to sequence initiatives.",
    "Ensure updates reinforce accountability and lifecycle governance consistency.",
    "Use DCAM control refinement guidance.",
    "Apply DCAM and CMMI institutionalization logic to ensure sustainability.",
    "Use DAMA artefact lifecycle practices to maintain long-term consistency."
  ]
}